-- MySQL dump 10.13  Distrib 8.0.31, for Win64 (x86_64)
--
-- Host: j8a205.p.ssafy.io    Database: bloommer
-- ------------------------------------------------------
-- Server version	8.0.21

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `diary`
--

DROP TABLE IF EXISTS `diary`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `diary` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `address` varchar(255) DEFAULT NULL,
  `content` varchar(255) DEFAULT NULL,
  `created_time` datetime(6) DEFAULT NULL,
  `img_src` varchar(255) DEFAULT NULL,
  `lat` double DEFAULT NULL,
  `lng` double DEFAULT NULL,
  `public_status` varchar(255) DEFAULT NULL,
  `x` varchar(255) DEFAULT NULL,
  `y` varchar(255) DEFAULT NULL,
  `z` varchar(255) DEFAULT NULL,
  `fid` bigint DEFAULT NULL,
  `gid` bigint DEFAULT NULL,
  `mid` bigint DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FKe849vqsgrjgd022v07sqndf8g` (`fid`),
  KEY `FKi0c0wss5o0p9bbjqdjt1lmlkr` (`gid`),
  KEY `FK9q12dwmjrowk0sfp8dmmyi6cx` (`mid`),
  CONSTRAINT `FK9q12dwmjrowk0sfp8dmmyi6cx` FOREIGN KEY (`mid`) REFERENCES `music` (`id`),
  CONSTRAINT `FKe849vqsgrjgd022v07sqndf8g` FOREIGN KEY (`fid`) REFERENCES `flower` (`id`),
  CONSTRAINT `FKi0c0wss5o0p9bbjqdjt1lmlkr` FOREIGN KEY (`gid`) REFERENCES `garden` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=80 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `diary`
--

LOCK TABLES `diary` WRITE;
/*!40000 ALTER TABLE `diary` DISABLE KEYS */;
INSERT INTO `diary` VALUES (1,' 멀티캠퍼스 역삼','오늘 명상을 했더니 평온해','2023-04-06 08:40:06.000000',NULL,37.503325874722,127.04403462366,'전체공개','0','1','0',6,2,163),(2,'멀티캠퍼스 역삼','오늘 서류를 붙어서 취업이 희망적이야','2023-04-06 08:41:26.000000',NULL,37.503325874722,127.04403462366,'전체공개','0','1.2','1.3',8,2,471),(3,'멀티캠퍼스 역삼','오늘 안에 개발을 끝낼수 있을까','2023-04-06 08:43:15.000000',NULL,37.503325874722,127.04403462366,'전체공개','-2.834171940684106','1','-2.2198304107618156',15,2,513),(4,'멀티캠퍼스 역삼','프로젝트 끝나간다 뿌듯해','2023-04-06 08:44:25.000000',NULL,37.503325874722,127.04403462366,'전체공개','0','0.7','1.2',7,1,531),(5,'멀티캠퍼스 역삼','좋아하는 그녀를 오늘 다시봤어 설렜다..','2023-04-06 08:45:31.000000',NULL,37.503325874722,127.04403462366,'전체공개','0.4','1.1','1.3',3,2,532),(6,'멀티캠퍼스 역삼','가고싶었던 기업에 떨어졌어 흑흑','2023-04-06 08:46:52.000000',NULL,37.503325874722,127.04403462366,'전체공개','-1.391680228492102','0.2','-2.571199070017954',21,2,602),(7,'멀티캠퍼스 역삼','내가 과연 취업을 할수 있을까 걱정이 되네...','2023-04-06 08:48:45.000000',NULL,37.503325874722,127.04403462366,'전체공개','0.3','1.2','-0.4',16,2,655),(8,'멀티캠퍼스 역삼','아 진짜 오늘 아무이유없이 너무 짜증나 그냥 ㅡㅡ','2023-04-06 08:49:15.000000',NULL,37.503325874722,127.04403462366,'전체공개','-1.3170696564542612','1.1','0.23124711193787562',13,2,675),(9,'멀티캠퍼스 역삼','오늘 친구한테 심한말을 들었어 너무 괴롭고 힘들다....','2023-04-06 08:49:54.000000',NULL,37.503325874722,127.04403462366,'전체공개','0.4','0.6','-0.6',20,2,720),(10,'멀티캠퍼스 역삼','이렇게 취업준비해서 내가 얻는게 뭘까 너무 허무해','2023-04-06 08:50:27.000000',NULL,37.503325874722,127.04403462366,'전체공개','-0.8610392631830219','0.9','-1.1981942831401327',24,2,732),(11,'멀티캠퍼스 역삼','내 이름은 윤동균이야 너를 봐서 너무 뿌듯하다 ㅎㅎ','2023-04-02 13:24:33.000000',NULL,37.503325874722,127.04403462366,'전체공개','0.44563981168708505','0','-1.0141167250354552',7,4,463),(12,'멀티캠퍼스 역삼','아싸 나 KCC정보통신 붙었다!!! 고마워요 SSAFY!!','2023-04-03 15:14:33.000000',NULL,37.503325874722,127.04403462366,'전체공개','-0.06126437800030299','0','0.6844683266811331',1,4,445),(13,'멀티캠퍼스 역삼','어제 치킨 먹어서 너무 행복하당ㅎㅎ 먹는게 제일 행복해!!','2023-04-04 22:35:33.000000',NULL,37.503325874722,127.04403462366,'전체공개','-2.344874902889106','0','-0.020009651738260636',2,4,572),(14,'멀티캠퍼스 역삼','너무 슬프다 흑흑 오늘 서류 탈락했어... 내가 뭐가 부족한거야 ㅠㅠ','2023-04-05 20:11:33.000000',NULL,37.503325874722,127.04403462366,'전체공개','-1.0023403777209121','0','-0.41367418301924186',21,4,673),(15,'멀티캠퍼스 역삼','어제 취업성장률이 낮아지고 실업률이 높아진다더라 너무 불안해...','2023-04-06 11:40:33.000000',NULL,37.503325874722,127.04403462366,'전체공개','2.6084080847331776','0','-0.025154836430584915',15,4,741),(16,'멀티캠퍼스 역삼','내 여자친구가 날 버렸어.. 두고보자 너... 잘되나볼거야..','2023-04-06 22:42:33.000000',NULL,37.503325874722,127.04403462366,'전체공개','1.2085635688093865','0','0.908409860258204',12,4,802),(17,'멀티캠퍼스 역삼','오늘은 날씨가 너무 좋더라 평화로운 하루였어 기분이 평화로워..','2023-04-07 08:00:33.000000',NULL,37.503325874722,127.04403462366,'전체공개','1.8','0','-0.9',6,4,921),(18,'멀티캠퍼스 역삼','아무것도 하기싫다.. 너무우울해','2023-04-06 23:57:33.000000',NULL,37.503325874722,127.04403462366,'전체공개','-1.4575755699077404','0','0.47231109137194593',8,4,786),(29,'멀티캠퍼스 역삼','오늘은 밥만 먹어서그런지 기분이 우울하네....','2023-04-06 11:05:31.000000',NULL,37.503325874722,127.04403462366,'전체공개','-0.5085243649141447','0','-3.034005857298471',25,8,22),(30,'멀티캠퍼스 역삼','너무 행복하당!! 먹고싶은걸 다 먹을수 있었어!!','2023-04-06 11:05:31.000000',NULL,37.503325874722,127.04403462366,'전체공개','-2.790102995636765','0','-0.265870190234768',1,8,53),(31,'멀티캠퍼스 역삼','원하던 기업의 2차면접을 남겨둔 지금 너무 행복해!!','2023-04-06 11:05:31.000000',NULL,37.503325874722,127.04403462366,'전체공개','-2.3340671809484483','0','-0.7668961365102867',2,8,163),(32,'멀티캠퍼스 역삼','원하는 사람들이랑 팀을 이뤄서 너무 기분이 좋아! 이행복 오래갔으면!!','2023-04-06 11:05:31.000000',NULL,37.503325874722,127.04403462366,'전체공개','-3.3413001116753023','0','-2.473467573689206',1,8,339),(33,'멀티캠퍼스 역삼','이유는 모르겠는데 요즘 자꾸 불안한 감정이 드는거 같다... 이유가 뭘까..','2023-04-06 11:05:31.000000',NULL,37.503325874722,127.04403462366,'전체공개','-1.2509427793836352','0','-0.9444948851181323',15,8,497),(34,'멀티캠퍼스 역삼','기업 최종발표가 며칠 안남았는데 내가 될수있을까...','2023-04-06 11:05:31.000000',NULL,37.503325874722,127.04403462366,'전체공개','-1.793447690047298','0','-2.933235963736891',16,8,546),(35,'멀티캠퍼스 역삼','내일 많은 사람들 앞에서 발표하려니 너무 긴장된다고 부끄러웡><','2023-04-06 11:05:31.000000',NULL,37.503325874722,127.04403462366,'전체공개','-1.4084769849035261','0','-0.18855193613438104',9,8,615),(36,'멀티캠퍼스 역삼','그녀석이 오늘 나의 마음을 알아버렸어.. 너무 당황스러운데..','2023-04-06 11:18:04.000000',NULL,37.503325874722,127.04403462366,'전체공개','3.1509595521830946','0','1.5276145686707379',11,6,654),(37,'멀티캠퍼스 역삼','오늘 하루는 너무 슬프다. 내사람이라고 느꼈던 사람이 내사람이 아니였다...','2023-04-06 11:18:04.000000',NULL,37.503325874722,127.04403462366,'비공개','0.39607356192774873','1','-1.2550112208018245',21,6,679),(38,'멀티캠퍼스 역삼','안정되있지 못하고 왜인지 자꾸 불안한 이느낌...','2023-04-06 11:18:04.000000',NULL,37.503325874722,127.04403462366,'전체공개','-3.5471202926949323','0','0.9397296141883045',15,6,795),(39,'멀티캠퍼스 역삼','평화로운 오늘 나는 햄버거를 먹었어 ㅎㅎㅎㅎ','2023-04-06 11:18:04.000000',NULL,37.503325874722,127.04403462366,'전체공개','-2.907704017602471','0','-0.8378623321471785',6,6,828),(40,'수원시','나는 햄버거를 너무 좋아해서 이걸 먹으면 몸이 평화로워져!','2023-04-06 11:18:04.000000',NULL,37.2635727,127.0286009,'전체공개','1.7','0','0.9',8,6,927),(41,'수원시','외로움. 그것은 참을 수 없는 슬픔이야...','2023-04-06 11:18:04.000000',NULL,37.2635727,127.0286009,'전체공개','-3.021478491001852','0','-1.8498530048534025',18,6,260),(51,'강남역','나에게 그녀가 다가왔다... 너무 행복행','2023-04-06 11:30:55.000000',NULL,37.498095,127.02761,'전체공개','1.3','0','-1',2,7,331),(52,'강남역','오늘 팀장님이 따로 밥을 사주셨다 너무 감사해요 ㅎㅎ','2023-04-06 11:30:55.000000',NULL,37.498095,127.02761,'전체공개','2.5779720666202572','0','0.33678329883408775',5,7,373),(53,'강남역','기업에 서류를 탈락해서 너무 슬프다 오늘은 치맥을 먹어야할듯..','2023-04-06 11:30:55.000000',NULL,37.498095,127.02761,'전체공개','2.6256294296730993','0','-1.8257222195479663',21,7,512),(54,'강남역','왜인지 모르게 오늘은 우울한 날이다. 슬프면서도 혼자있고싶은 그런날...','2023-04-06 11:30:55.000000',NULL,37.498095,127.02761,'전체공개','-3.3240241614652333','0','-0.044917096529362155',21,7,512),(55,'강남역','인생은 원래 혼자라 그랬어... 혼자 있고 싶다..','2023-04-06 11:30:55.000000',NULL,37.498095,127.02761,'전체공개','-3.4999692013201176','0','-2.4745774703321475',22,7,677),(56,'강남역','안정되지 않은 불안정한 상태... 이걸 어떻게 해결할 수 있을까..??','2023-04-06 11:30:55.000000',NULL,37.498095,127.02761,'전체공개','1.7586468081332733','0','1.9359010264553747',15,7,705),(57,'강남역','내가 이것밖에 안되다니 반성도 되면서 스스로에게 실망이 되는날...','2023-04-06 11:30:55.000000',NULL,37.498095,127.02761,'전체공개','-2.5941596236589013','0','0.6573514409093457',10,7,713),(58,'멀티캠퍼스 역삼','혼자 있어서 그런지 오늘은 외롭고 고독한 하루네... 끊었던 담배가 생각나','2023-04-06 11:32:36.000000',NULL,37.503325874722,127.04403462366,'전체공개','-3.201336790176331','0','-1.2525940155164719',22,11,718),(59,'멀티캠퍼스 역삼','나도 드디어 남자친구가 생겼어 너무 설레!!','2023-04-06 11:32:36.000000',NULL,37.503325874722,127.04403462366,'전체공개','-2.1328495621691026','0','-1.3137374741499563',4,11,724),(60,'멀티캠퍼스 역삼','요즘 취업이 힘들어지니까 그런지 불안한 마음이 계속드는거 같다..','2023-04-06 11:32:36.000000',NULL,37.503325874722,127.04403462366,'전체공개','-2.318174075660142','0','-0.037830440590219894',15,11,627),(61,'멀티캠퍼스 역삼','오늘 ssafy하면서 첫 프로젝트를 성공적으로 마칠거같은 희망을 봤다..','2023-04-06 11:32:36.000000',NULL,37.503325874722,127.04403462366,'전체공개','-3.201336790176331','0','-1.2525940155164719',8,11,558),(62,'멀티캠퍼스 역삼','내나이 스물 여섯.. 삶이란 무엇일까 그 누가 답을 주었으면..','2023-04-06 11:32:36.000000',NULL,37.503325874722,127.04403462366,'전체공개','-0.6908331736619147','0','-2.5477278826560834',24,11,518),(63,'멀티캠퍼스 역삼','너를 만나 너무기쁘고 다음에도 너였으면 좋을거같아. 나는 기뻐!','2023-04-06 11:32:36.000000',NULL,37.503325874722,127.04403462366,'전체공개','-0.3821571961571202','0','-3.4745659074667934',1,11,381),(64,'멀티캠퍼스 역삼','면접을 내가 잘칠수있을까... 가슴떨리고 긴장돼...','2023-04-06 11:32:36.000000',NULL,37.503325874722,127.04403462366,'전체공개','-0.9049885884136941','0','-1.6890832205848199',17,11,357),(65,'멀티캠퍼스 역삼','그 나쁜것이 내 남자친구를 뺐었어 나는 용서가안돼!','2023-04-06 11:32:36.000000',NULL,37.503325874722,127.04403462366,'전체공개','-2.5510969963534507','0','-2.5936271830933997',14,11,535),(66,'서울 서초구 서초동 1319-1','벌써 9시다 졸리다.. 집은 언제 가지','2023-04-06 21:24:48.007000',NULL,37.49758106761647,127.02716325057365,'전체공개','-1.9928108293504891','0.5','-3.2508220395331797',13,11,495),(67,'서울특별시 서초구 사임당로 157','짜증난다.','2023-04-06 21:26:25.084000',NULL,37.4923687,127.0267928,'전체공개','-3.140043075433873','0.5','0.9017811890597933',13,11,358),(68,'멀티캠퍼스 역삼','3월도 다가고 평온한데','2023-03-30 00:00:00.000000',NULL,37.503325874722,127.04403462366,'전체공개','1.1','0','-0.3',6,13,163),(69,'서울특별시 서초구 사임당로 157','여행가고 싶다. 진짜루','2023-04-06 21:51:26.239000',NULL,37.4923687,127.0267928,'전체공개','1.4244548755462696','0','-0.8087576456108101',8,11,478),(71,'SENOK','친구랑 카페에서 하루종일 과제를 했는데도 다 끝내지 못했다. 아직도 많이 남았는데 어떡하지..ㅜㅜ 다 끝내야 하는데 오늘 잠은 다 잤다.','2023-03-17 23:56:00.000000',NULL,37.51279875050766,127.02842427376856,'전체공개','1','0','0.5',19,16,512),(72,'서울 은평구 녹번동 153-25','오늘 팀원들과 밤늦게 까지 코딩을 했다. 혼자 했으면 힘들었겠지만 함께해서 즐겁게 했다. 열심히한 만큼 좋은 결과 있었으면 좋겠다.','2023-04-07 00:32:49.222000',NULL,37.6045568,126.9235712,'전체공개','-1.999495295955581','0','0.5378967666468082',8,7,163),(73,'멀티캠퍼스 역삼','프로젝트가 끝나서 너~~무 홀가분해요~~!!!','2023-04-07 00:55:19.620000','fef644aea89649a0abca7ad44a67d688.png',37.5012860931305,127.039604663862,'전체공개','0.106356002177981','-0.1','0.7263476077160237',1,17,163),(74,'멀티캠퍼스 역삼','아침부터 저녁까지 쉴 틈 없이 달려온 하루였다.. 내일은 조금 더 나은 하루가 되었으면 좋겠다','2023-04-07 02:05:34.361000','d7263bfb0ad04cb28822514128646b43.png',37.5012860931305,127.039604663862,'비공개','-3.051634673080121','0','0.2706877104547081',8,18,163),(75,'경기 성남시 분당구 수내동 산 66','버그가 너무 싫다,,,,, 정말 말 그대로 벌레 그 자체,, 고치고 고쳐도 또 생겨나고 또 생겨난다. 언제쯤 사라질까 ㅠㅠㅠㅠㅠㅠ \n살려줘어어어?','2023-04-07 02:18:13.190000','cdab2ffdf892454ebe55dfd7ec26e7c2.png',37.3620736,127.1332864,'전체공개','3.3917987324932555','0','0.27533086597999645',13,6,512),(78,'멀티캠퍼스 역삼','오늘보다 나은 내일이 되기 위해 더 노력하자 !!','2023-04-07 02:44:36.877000','2fce78765846400281e6a619c94dfa10.png',37.5012860931305,127.039604663862,'비공개','2.8861974478552956','0','-1.3397725153968727',8,7,37),(79,'CGV 강남','오늘 영화를 봤는데 보는 내내 눈물이 멈추지 않았다. 계속 머리속에서 영화의 명장면이 스쳐지나간다. 오늘따라 부모님이 많이 보고 싶다 ㅠㅠ','2023-03-22 21:56:00.000000',NULL,37.51279875050766,127.02842427376856,'전체공개','0','0','0.5',21,16,679);
/*!40000 ALTER TABLE `diary` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-04-07  3:19:18
